Repository: onejeuu/sc-file
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: ru

source: Frequently Asked Questions
ru: Часто Задаваемые Вопросы

source: 📌 General
ru: 📌 Общее

source: Q: How to encode files back into game formats?
ru: В: Как закодировать файлы обратно в игровые форматы?

source: **Reverse encoding is unsupported on purpose.**
ru: **Обратная кодировка не поддерживается намеренно.**

source: Even though it's possible to create this feature, making it public could cause problems.
ru: Несмотря на возможность создания такой функции, ее публикация может привести к проблемам.

source: **Formats changes risk**: If modifying game files becomes too easy, developers might start encrypting or complicating their assets.
ru: **Риск изменения форматов**: Если модификация игровых файлов станет слишком простой, разработчики могут начать шифровать свои ассеты.

source: **Cheating concerns**: Public reverse encoding would make creating hacks much easier, attracting unwanted attention and undermining this tool purpose.
ru: **Проблемы читерства**: Публичное обратное кодирование значительно упростит создание хаков, что привлечет нежелательное внимание и подорвет назначение этого инструмента.

source: My goal is to support research and creativity, not to create tools that could harm the game community.
ru: Моя цель — поддерживать исследование и творчество, а не создавать инструменты, которые могут навредить игровому сообществу.

source: If you need assistance with in-game content creation tasks, you can `contact me directly <TG_>`_.
ru: Если вам нужна помощь в создании внутри-игрового контента, вы можете `связаться со мной напрямую <TG_>`_.

source: Q: After game update ``%any_filename%`` no longer decodes!
ru: В: После обновления игры ``%любой_файл%`` больше не декодируется!

source: Format structure may have been updated. Wait for program update. In case of large changes, it might take some time to adapt.
ru: Структура формата могла измениться. Дождитесь обновления программы. В случае значительных изменений это может занять некоторое время.

source: Q: Could using this program lead to game ban?
ru: В: Может ли использование этой программы привести к блокировке в игре?

source: Use at your own risk.
ru: Используйте на свой страх и риск.

source: **Some basic recommendations:**
ru: **Некоторые базовые рекомендации:**

source: You **MUST** close both game and launcher **BEFORE** interacting with any assets files.
ru: Вы **ДОЛЖНЫ** закрыть игру и лаунчер **ПЕРЕД** взаимодействием с любыми файлами ассетов.

source: You **MUST NOT** leave any files or modifications in game assets directory.
ru: Вы **НЕ ДОЛЖНЫ** оставлять какие-либо файлы или изменения в каталоге игровых ресурсов.

source: You **SHOULD** copy required files to separate directory **BEFORE** performing any manipulations.
ru: Вам **СЛЕДУЕТ** скопировать необходимые файлы в отдельный каталог **ПЕРЕД** выполнением каких-либо манипуляций.

source: 📤 Output Formats
ru: 📤 Выходные форматы

source: Q: What programs supports ``.dds`` viewing?
ru: В: Через какие программы смотреть ``.dds`` текстуры?

source: Any programs with full support for all `DirectDraw Surface <DDS_>`_ formats.
ru: Любые программы с полной поддержкой всех форматов `DirectDraw Surface <DDS_>`_.

source: **Recommended Viewers:**
ru: **Программы для просмотра:**

source: `XnView <XNVIEW_>`_ (Universal)
ru: `XnView <XNVIEW_>`_ (Универсальный)

source: `WTV <WTV_>`_ (Lightweight)
ru: `WTV <WTV_>`_ (Легковесный)

source: `RenderDoc <RENDERDOC_>`_ (Analysis)
ru: `RenderDoc <RENDERDOC_>`_ (Анализ)

source: Q: How to convert ``.dds`` textures to ``.png``?
ru: В: Как конвертировать ``.dds`` текстуры в ``.png``?

source: Native support is not planned for code simplicity.
ru: Нативная поддержка не планируется ради простоты кода.

source: If needed, convert ``.dds`` to ``.png`` using `ImageMagick <IMAGEMAGICK_>`_.
ru: Если необходимо используйте `ImageMagick <IMAGEMAGICK_>`_ для конвертации.

source: Command Example
ru: Пример команды

source: Q: Why model have weird/black textures?
ru: В: Почему у модели странные/черные текстуры?

source: Make sure texture node alpha mode is set to ``Channel Packed`` (`Screenshot <ALPHAMODE_>`_).
ru: Убедитесь что у ноды текстуры ``Alpha Mode`` поставлен на ``Channel Packed`` (`Скриншот <ALPHAMODE_>`_).

source: Some models seem to have mixed-up suffixes in filenames.
ru: Некоторые модели, похоже, имеют перепутанные суффиксы текстур.

source: Make sure that the ``_diff`` texture is actually a Diffuse Map and the ``_spek`` texture is a Specular Map.
ru: Убедитесь что ``_diff`` текстура действительно является Diffuse Map, а ``_spek`` текстура Specular Map.

source: :doc:`More about Suffix Conventions... <formats>`
ru: :doc:`Подробнее про Конвенции суффиксов... <formats>`

source: ⛔ Unsupported Formats
ru: ⛔ Неподдерживаемые форматы

source: Q: Why world map cache (``.mdat``) unsupported?
ru: В: Почему кеш карты (``.mdat``) не поддерживается?

source: Structure resembles `minecraft chunk <MCA_>`_. But this format is too complex and possibly `AES Encrypted <AES_>`_.
ru: Структура напоминает `чанки minecraft <MCA_>`_. Но этот формат похоже `зашифрован через AES <AES_>`_.

source: If you figure it out, feel free to contribute to `Pull Requests <https://github.com/onejeuu/sc-file/pulls>`_.
ru: Если вы с ним разберетесь, не стесняйтесь вносить вклад в `Pull Requests <https://github.com/onejeuu/sc-file/pulls>`_.

source: Q: Why animations library (``.mcal``) unsupported?
ru: В: Почему библиотека анимаций (``.mcal``) не поддерживается?

source: This format is currently unusable due to its fragmented and technical nature.
ru: В настоящее время этот формат непригоден для использования из-за его фрагментированности и технического характера.

source: For example: character animations stored in ``pack.mcal``.
ru: Например: анимации персонажей хранятся в ``pack.mcal``.

source: But each has just few frames, totaling around **~5,000** entries.
ru: Но в каждом клипе всего несколько кадров, а всего около **~5000** записей.

source: Unpacking is pointless, these are just broken-up animation fragments, not usable clips.
ru: Распаковывать их бессмысленно, это всего лишь разбитые фрагменты анимации, а не готовые клипы.

source: Also, CLI can't handle them. They need paired model files, breaking current input logic.
ru: Кроме того, CLI не может их обрабатывать. Им нужны парные файлы моделей, что нарушает текущую логику ввода.

source: *This might change in the future, but for now, there's no clear solution.*
ru: *В будущем это может измениться, но на данный момент нет четкого решения.*

source: Q: Why json bundle (``.xeon``) unsupported?
ru: В: Почему пакет json (``.xeon``) не поддерживается?

source: This format is `AES Encrypted <AES_>`_. This encryption is unbreakable.
ru: Этот формат `зашифрован через AES <AES_>`_. Это шифрование невозможно взломать.

source: If you have information about key (password) for game assets, would be nice to know details `in DM <TG_>`_.
ru: Если у вас есть информация о ключе (пароле) для ассетов, было бы здорово узнать подробности в `ЛС <TG_>`_.
