Repository: onejeuu/sc-file
Catalog: docs/locale/*/LC_MESSAGES/formats.po
Languages: ru

source: 🎮 Game Formats
ru: 🎮 Игровые Форматы

source: Formats specifications are based on **reverse-engineering efforts** and may contain inaccuracies. Subject to change.
ru: Спецификации форматов основаны на **обратной инженирии** и могут содержать неточности.

source: 🧊 Model Formats
ru: 🧊 Модели

source: Configuration: Flags, Scales.
ru: Конфигурация: флаги, размеры.

source: Geometry: Name, Material, Vertex Position, UVs, Normals, Polygons.
ru: Геометрия: название, материал, вершины, UV, нормали, полигоны.

source: Optional: Skeleton bones, Animation clips.
ru: Дополнительно: кости скелета, анимационные клипы.

source: Identical to ``.mcsa`` but with integrity check.
ru: Идентично ``.mcsa``, но с проверкой целостности.

source: Contains leading hash to prevent tampering.
ru: Содержит хеш для предотвращения замены.

source: Simplified low-poly geometry.
ru: Упрощенная низкополигональная геометрия.

source: Includes animation data.
ru: В основном данные анимации.

source: Used for physics/collision trace detection.
ru: Иногда используется для обнаружения столкновений/физики.

source: Metadata: frame count, bone count.
ru: Метаданные: количество кадров, количество костей.

source: Technical skeletal animation transforms (per bone).
ru: Преобразования скелетной анимации.

source: Model-specific (requires matching skeleton).
ru: Специфично для модели (требуется соответствующий скелет).

source: Slices of safezone (world as 3D model).
ru: Срезы безопасной зоны (карта мира в виде 3D-модели).

source: Used in safezone workbench rendering.
ru: Используется в рендеринге безопасной зоны через верстак.

source: 🧱 Texture Formats
ru: 🧱 Текстуры

source: Standard ``.dds`` (`DirectDraw Surface <DDS_>`_).
ru: Стандартный ``.dds`` (`DirectDraw Surface <DDS_>`_).

source: Has simplified structure and `mipmaps <MIPMAP_>`_ are compressed using `LZ4`_.
ru: Имеет упрощенную структуру, а `mipmaps <MIPMAP_>`_ сжимаются с помощью `LZ4`_.

source: Some `normal maps <NORMALMAP_>`_ textures can be inverted.
ru: Некоторые текстуры `нормальных карт <NORMALMAP_>`_ могут быть инвертированы.

source: Some textures can be `cube maps <CUBEMAP_>`_. (OLCUBEMAP.bt_)
ru: Некоторые текстуры могут быть `кубическими картами <CUBEMAP_>`_. (OLCUBEMAP.bt_)

source: Mainly located in: ``gloomycore/sky``, ``effects/textures``, ``stalker/gui``.
ru: В основном расположены в: ``gloomycore/sky``, ``effects/textures``, ``stalker/gui``.

source: Texture Suffix Conventions
ru: Конвенция суффиксов

source: Suffix
ru: Суффикс

source: Map
ru: Карта

source: Type
ru: Тип

source: Purpose
ru: Назначение

source: Contains raw surface color without lighting or reflections.
ru: Содержит необработанный цвет поверхности без освещения и отражений.

source: Defines intensity and sharpness of highlights/reflections.
ru: Определяет интенсивность и резкость бликов/отражений.

source: Simulates small bumps/dents without changing geometry.
ru: Имитирует небольшие вмятины/выпуклости без изменения геометрии.

source: Makes parts glow or emit light independently.
ru: Заставляет детали светиться или излучать свет.

source: Standard ``.png`` (`Portable Network Graphics <PNG_>`_).
ru: Стандартный ``.png`` (`Portable Network Graphics <PNG_>`_).

source: Has modified `file signature <SIG_>`_.
ru: Имеет измененную `сигнатуру файла <SIG_>`_.

source: Previously used for game `GUI`_.
ru: Ранее использовался для `GUI`_.

source: Container for ``.dds`` (`DirectDraw Surface <DDS_>`_) textures.
ru: Контейнер для ``.dds`` текстур (`DirectDraw Surface <DDS_>`_).

source: Textures referenced as ``group:path`` (e.g., ``probuilder:general/generic``).
ru: Текстуры указываются как ``группа:путь`` (например, ``probuilder:general/generic``).

source: 🗂️ Other Formats
ru: 🗂️ Прочее

source: Contains large `JSON`_ structure. `AES Encrypted <AES_>`_.
ru: Содержит большую `JSON`_ структуру. `Зашифровано через AES <AES_>`_.

source: Once encrypted individually ``.eon`` files combined into bundles.
ru: Отдельно зашифрованные файлы ``.eon`` объединенные в единые пакеты.

source: 🛠️ Launcher Formats
ru: 🛠️ Лаунчер

source: Contains SHA-1 hash mappings for game files.
ru: Содержит маппинг SHA-1 хэшей для файлов игры.

source: Used by launcher for integrity verification.
ru: Используется лаунчером для проверки целостности игры.

source: Modified ``.torrent`` (`Torrent <TORRENT_>`_) file.
ru: Измененный файл ``.torrent`` (`Torrent <TORRENT_>`_).

source: Used by game launcher for content delivery.
ru: Используется лаунчером для доставки контента.

source: Trackers block unauthorized access (token required).
ru: Трекеры блокируют несанкционированный доступ (требуется токен).

source: 🗃️ NBT Formats
ru: 🗃️ NBT

source: Uncompressed **NBT** (`Named Binary Tag <NBT_>`_) format and can be viewed/edited with tools like `NBT Explorer <NBTE_>`_. Can be raw, but in game uses ``GZIP`` or ``ZSTD`` compression.
ru: Распакованный **NBT** (`Named Binary Tag <NBT_>`_), может быть просмотрен/отредактирован с помощью таких инструментов, как `NBT Explorer <NBTE_>`_. Может быть в сыром виде, но в игре используется сжатие ``GZIP`` или ``ZSTD``.

source: Assets
ru: Ассеты

source: Filename
ru: Имя файла

source: Compression
ru: Сжатия

source: Keys (examples)
ru: Ключи (примеры)

source: **Quests items descriptions**.
ru: **Описание квестовых предметов**

source: Configs
ru: Конфиги

source: **UI read state cache**. Tracks seen articles, experiences, tutorial prompts, and ads.
ru: **Кеш состояния прочтения UI**. Отслеживает просмотренные статьи, события, подсказки обучения и донатные объявления.

source: Per-Character Configs
ru: Персональные конфиги персонажа

source: Located in ``/config/%CharacterName%/``.
ru: Расположены в ``/config/%ИмяПерсонажа%/``.

source: Files prefixed with ``sd`` (**Synced Data**) contain synchronized player state cached locally.
ru: Файлы с префиксом ``sd`` (**Synced Data**) содержат синхронизированное состояние игрока, закэшированные локально.

source: **General settings and UI states**. Loot filter ("trashed" items), Reports cooldown, Events UI toggles, Viewed tutorials and introductions.
ru: **Основные настройки и состояния UI**. Фильтр лута ("ненужные" предметы), cooldown отправки репортов, переключатели UI событий, просмотренные туториалы и введения ивентов.

source: **Incoming friend requests**. Contains a list of pending requests for UI.
ru: **Входящие заявки в друзья**. Содержит список ожидающих заявок для UI.

source: **Recent interactions** (last 200 players). Stores usernames, faction IDs, and interaction type for the "Recently Interacted" UI.
ru: **Недавние взаимодействия** (последние 200 игроков). Хранит имена пользователей, ID фракций и тип взаимодействия для UI "Недавние взаимодействия".

source: **Notifications history** (last 100 popups). Stores message content, read status, and dynamic ``payload`` (varies by notification type).
ru: **История уведомлений** (последние 100 всплывающих окон). Хранит содержание сообщения, статус прочтения и динамические данные ``payload`` (зависят от типа уведомления).

source: **Store (donate shop) view history**. Tracks observed shop offers.
ru: **История просмотра магазина (донат)**. Отслеживает просмотренные предложения магазина.

source: **Profile customization UI state**. Tracks last seen versions of backgrounds, patterns, stickers, and tags.
ru: **Состояние UI кастомизации профиля**. Отслеживает последние просмотренные версии фонов, узоров, стикеров и тегов.

source: ⚙️ Config Formats
ru: ⚙️ Конфиги

source: Format
ru: Формат

source: Text
ru: Текст

source: Selected display ID
ru: ID выбранного монитора

source: Keyboard control mappings
ru: Назначения клавиш управления

source: Game settings (graphics, audio, gameplay)
ru: Настройки игры (графика, звук, геймплей)

source: Quest visibility toggles
ru: Переключатели видимости квестов

source: Custom map markers
ru: Пользовательские метки на карте
