Repository: onejeuu/sc-file
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Index
ru: Индекс

source: Overview
ru: Обзор

source: **scfile** is a utility and library for converting proprietary Stalcraft assets formats to standard ones.
ru: **scfile** это утилита и библиотека для конвертации проприетарных форматов ассетов игры Stalcraft в стандартные.

source: This is an **unofficial** project and is **not affiliated** with EXBO.
ru: Данный проект является **неофициальным** и **не аффилирован** с EXBO.

source: ✨ Supported Formats
ru: ✨ Поддерживаемые форматы

source: Type
ru: Тип

source: Game formats
ru: Игровые форматы

source: Standard formats
ru: Стандартные форматы

source: 🧊 **Model**
ru: 🧊 **Модель**

source: 🧱 **Texture**
ru: 🧱 **Текстура**

source: 🖼️ **Image**
ru: 🖼️ **Изображение**

source: 📦 **Archive**
ru: 📦 **Архив**

source: ⚙️ **Data**
ru: ⚙️ **Данные**

source: \* ``NBT`` refers to specific files (``itemnames.dat``, ``prefs``, ``sd0``, etc.)
ru: \* ``NBT`` Относится к специфичным файлам (``itemnames.dat``, ``prefs``, ``sd0`` и т.д.)

source: **Reverse conversion** (``standard`` → ``game``) **is not available.**
ru: **Обратная конвертация** (``стандартный`` → ``игровой``) **недоступна.**

source: 📚 :doc:`See FAQ for details → <faq>`
ru: 📚 :doc:`Подробности в FAQ → <faq>`

source: 📚 :doc:`Detailed formats support → <support>`
ru: 📚 :doc:`Детальная информация о поддержке форматов → <support>`

source: 🚀 Quick Start
ru: 🚀 Быстрый старт

source: **Three ways to get started:** download, install, or compile.
ru: **Три способа начать:** скачать, установить или скомпилировать.

source: 1. 💻 Download executable
ru: 1. 💻 Скачать исполняемый файл

source: Standalone ``scfile.exe`` available on `Releases page <https://github.com/onejeuu/sc-file/releases>`_
ru: Standalone ``scfile.exe`` доступен на `странице Releases <https://github.com/onejeuu/sc-file/releases>`_

source: *No Python required.*
ru: *Не требует установки Python.*

source: **Usage:**
ru: **Использование:**

source: 📥 **Drag & Drop**: drag file onto ``scfile.exe``
ru: 📥 **Drag & Drop**: перетащите файл на ``scfile.exe``

source: `What is drag and drop? <DND_>`_
ru: `Что такое drag and drop? <DND_>`_

source: 🖱️ **Open With**: set as default app for supported formats
ru: 🖱️ **Открыть с помощью**: установите приложением по умолчанию для поддерживаемых форматов

source: `How to set default app (Windows)? <DEFAPP_>`_
ru: `Как установить приложение по умолчанию (Windows)? <DEFAPP_>`_

source: 📟 **Command Line**: ``scfile.exe --help``
ru: 📟 **Командная строка**: ``scfile.exe --help``

source: `What is command line interface? <CLI_>`_
ru: `Что такое командный интерфейс? <CLI_>`_

source: *Example:* ``scfile.exe model.mcsb -F glb --skeleton``
ru: *Пример:* ``scfile.exe model.mcsb -F glb --skeleton``

source: *Options:* ``-F`` *picks model format,* ``--skeleton`` *extracts armature.*
ru: *Опции:* ``-F`` *выбирает формат модели,* ``--skeleton`` *извлекает скелет и кости.*

source: 2. 🐍 Install Python package
ru: 2. 🐍 Установить Python пакет

source: **Install:**
ru: **Установка:**

source: 📖 **Python library**: *See Library section*
ru: 📖 **Python библиотека**: *См. раздел Библиотека*

source: 📟 **CLI via package**: ``scfile --help``
ru: 📟 **CLI через пакет**: ``scfile --help``

source: 3. 🔧 Compile from source
ru: 3. 🔧 Скомпилировать из исходников

source: Build from source code using the :doc:`compile guide <compile>`.
ru: Соберите из исходного кода, используя :doc:`руководство по сборке <compile>`.

source: *For developers, contributors, or custom builds.*
ru: *Для разработчиков, контрибьюторов или пользовательских сборок.*

source: 📖 Library
ru: 📖 Библиотека

source: **Install latest version:**
ru: **Установите последнюю версию:**

source: Usage example
ru: **Пример использования:**

source: 📚 :doc:`Complete Library API reference → <api/index>`
ru: 📚 :doc:`Полное описание API библиотеки → <api/index>`

source: 🔗 Links
ru: 🔗 Ссылки

source: ``❓`` **Questions?** Check :doc:`FAQ <faq>` or `contact me <TG_>`_
ru: ``❓`` **Есть вопросы?** Ознакомьтесь с :doc:`FAQ <faq>` или `свяжитесь со мной <TG_>`_

source: ``🐛`` **Found a bug?** `Open an issue <ISSUES_>`_
ru: ``🐛`` **Нашли баг?** `Создайте issue <ISSUES_>`_

source: ``💻`` **Download executable:** `Latest release <RELEASES_>`_
ru: ``💻`` **Скачать исполняемый файл:** `Последний релиз <RELEASES_>`_

source: ``🔧`` **Compile from source:** :doc:`Build guide <compile>`
ru: ``🔧`` **Скомпилировать из исходников:** :doc:`Руководство по сборке <compile>`

source: 🤝 Acknowledgments
ru: 🤝 Благодарности

source: Thanks to everyone who reported issues, shared findings, or contributed ideas.
ru: Спасибо всем, кто сообщал об ошибках, делился находками или вносил идеи.
