Repository: onejeuu/sc-file
Catalog: docs/locale/*/LC_MESSAGES/support.po
Languages: ru

source: Formats Support
ru: Поддержка Форматов

source: Supported Versions: ``7.0``, ``8.0``, ``10.0``, ``11.0``
ru: Поддерживаемые версии: ``7.0``, ``8.0``, ``10.0``, ``11.0``

source: Output Formats
ru: Выходные Форматы

source: Suffix
ru: Суффикс

source: Name
ru: Название

source: Skeleton
ru: Скелет

source: Animation
ru: Анимации

source: Speed
ru: Скорость

source: **Feature:**
ru: **Функция:**

source: ✅ Supported
ru: ✅ Поддерживается

source: ❌ Not supported by scfile
ru: ❌ Не поддерживается scfile

source: ➖ Not supported by format
ru: ➖ Не поддерживается форматом

source: Benchmarks were performed using one of the most complex 3D model.
ru: Тестирование скорости экспорта проводилось на одной из самых комплексных 3D-моделей.

source: Note that average results may vary.
ru: Средние результаты могут варьироваться.

source: Supported Formats: ``DXT1``, ``DXT3``, ``DXT5``, ``RGBA8``, ``BGRA8``, ``DXN_XY``, ``RGBA32F``
ru: Поддерживаемые форматы: ``DXT1``, ``DXT3``, ``DXT5``, ``RGBA8``, ``BGRA8``, ``DXN_XY``, ``RGBA32F``

source: Supported Types: ``Texture``, ``Normalmap``, ``Cubemap``
ru: Поддерживаемые типы: ``Texture``, ``Normalmap``, ``Cubemap``

source: Output Format: ``.dds`` (`DirectDraw Surface <DDS_>`_)
ru: Выходной формат: ``.dds`` (`DirectDraw Surface <DDS_>`_)

source: **Recommended Viewers:**
ru: **Программы для просмотра:**

source: `XnView <XNVIEW_>`_ (Universal)
ru: `XnView <XNVIEW_>`_ (Универсальный)

source: `WTV <WTV_>`_ (Lightweight)
ru: `WTV <WTV_>`_ (Легковесный)

source: `RenderDoc <RENDERDOC_>`_ (Analysis)
ru: `RenderDoc <RENDERDOC_>`_ (Анализ)

source: Known Formats
ru: Известные Форматы

source: Encoded
ru: Зашифр.

source: Decoded
ru: Расшифр.

source: Format
ru: Формат

source: Compression
ru: Сжатие

source: `More about Compression... <S3TC_>`_
ru: `Подробнее об S3TC сжатии... <S3TC_>`_

source: Absolutely identical to ``.png`` (`Portable Network Graphics <PNG_>`_)
ru: Абсолютно идентично ``.png`` (`Portable Network Graphics <PNG_>`_)

source: Only difference is `file signature <SIG_>`_ *(first 4 bytes)*
ru: Единственное отличие это `сигнатура файла <SIG_>`_ *(первые 4 байта)*

source: Output Format: ``.zip`` (`ZIP <ZIP_>`_)
ru: Выходной формат: ``.zip`` (`ZIP <ZIP_>`_)

source: Textures Format: ``.dds`` (`DirectDraw Surface <DDS_>`_)
ru: Формат текстур: ``.dds`` (`DirectDraw Surface <DDS_>`_)
