Repository: onejeuu/sc-file
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: ru

source: Usage
ru: Использование

source: **Easiest Way:** Use `Drag & Drop <DND_>`_. Just drag and drop files you want convert onto ``scfile.exe``. File paths will automatically be taken as arguments, converted to new format, and saved in same location.
ru: **Проще всего:** используйте `Drag & Drop <DND_>`_. Просто перетащите файлы, которые хотите конвертировать, на ``scfile.exe``. Пути к файлам будут автоматически приняты в качестве аргументов, конвертированы в новый формат и сохранены в том же месте.

source: **File Associations:** You can set ``scfile.exe`` as the default application for opening model and texture files. When a file is "opened" this way, it will be automatically converted to new format and saved in same location.
ru: **Ассоциации файлов:** Вы можете установить ``scfile.exe`` в качестве приложения по умолчанию для открытия файлов моделей и текстур. Когда файл «открывается» таким образом, он автоматически конвертируется в новый формат и сохраняется в том же месте.

source: **Via Console:** ``scfile`` is primarily a `CLI <CLI_>`_. If you're comfortable with the terminal, you'll figure it out fast. Check out arguments and options with ``scfile.exe --help``.
ru: **Через консоль:** ``scfile`` это в основном `CLI <CLI_>`_. Если вы хорошо знакомы с терминалом, то быстро разберетесь. Проверьте аргументы и опции с помощью ``scfile.exe --help``.

source: **As Library:** Install release build using ``pip install sc-file`` or any other package manager.
ru: **Как библиотеку:** Установите релизную сборку с помощью ``pip install sc-file`` или любого другого менеджера пакетов.

source: :doc:`More details in API Reference... <api/index>`
ru: :doc:`Более подробно про API библиотеки... <api/index>`

source: Simple code example
ru: Простой пример кода

source: This code takes all ``.mcsb`` files from ``models`` directory, converts them to ``.glb``, and dumps into ``output``.
ru: Этот код берет все файлы ``.mcsb`` из каталога ``/models``, конвертирует их в ``.glb`` и складывает в ``/output``.

source: Output Model Formats
ru: Выходные Форматы Моделей

source: Specify ``--mdlformat`` / ``-F`` parameter followed by desired format suffix.
ru: Укажите параметр ``--mdlformat`` / ``-F``, за которым следует суффикс желаемого формата.

source: For example: ``-F obj`` or ``-F dae``.
ru: Например: ``-F obj`` или ``-F dae``.

source: To specify multiple formats at once, you need to use parameter multiple times.
ru: Чтобы указать сразу несколько форматов, необходимо использовать параметр несколько раз.

source: For example: ``scfile.exe model.mcsb -F obj -F dae -F ms3d``
ru: Например: ``scfile.exe model.mcsb -F obj -F dae -F ms3d``

source: This command will create three files: ``model.obj``, ``model.dae``, ``model.ms3d``.
ru: Эта команда создаст три файла: ``model.obj``, ``model.dae``, ``model.ms3d``.

source: Default Model Formats
ru: Стандартные Форматы Моделей

source: Default Behavior (without ``-F`` parameter):
ru: Поведение по умолчанию (без параметра ``-F``):

source: Uses ``consts.py::DefaultModelFormats.STANDARD``: ``.obj``.
ru: Использует ``consts.py::DefaultModelFormats.STANDARD``: ``.obj``.

source: If ``--skeleton`` or ``--animation`` is specified:
ru: Если указан ``--skeleton`` или ``--animation``:

source: Uses ``consts.py::DefaultModelFormats.SKELETON``: ``.glb``.
ru: Использует ``consts.py::DefaultModelFormats.SKELETON``: ``.glb``.

source: **Two ways to change it:**
ru: **Два способа изменить это:**

source: **Easiest Way:** Create a shortcut for the ``scfile.exe``. At end of «Target» field, add desired formats like in examples above.
ru: **Проще всего:** создайте ярлык ``scfile.exe``. В конце поля «Цель» добавьте желаемые форматы, как в примерах выше.

source: **Modify Source Code:** Alternatively, tweak this consts in source code and :doc:`compile yourself <compile>`.
ru: **Изменение исходного кода:** Измените эти константы в исходном коде и :doc:`скомпилируйте самостоятельно <compile>`.

source: Model Skeleton
ru: Скелет Модели

source: Specify ``--skeleton`` flag.
ru: Укажите флаг ``--skeleton``.

source: If skeleton has presented, it will be exported.
ru: Если скелет существует, он будет экспортирован.

source: Output formats with armature support: ``.glb``, ``.dae``, ``.ms3d``.
ru: Выходные форматы с поддержкой скелета: ``.glb``, ``.dae``, ``.ms3d``.

source: Model Animation
ru: Анимации Модели

source: Specify ``--animation`` flag.
ru: Укажите флаг ``--animation``.

source: If skeleton and animation has presented, it will be exported.
ru: Если анимации существуют, они будут экспортированы.

source: Output formats with animation support: ``.glb``.
ru: Выходные форматы с поддержкой анимации: ``.glb``.

source: `List of files with built-in clips <ANIMSLIST_>`_ (can be outdated).
ru: `Список файлов со встроенными клипами <ANIMSLIST_>`_ (может быть устаревшим).

source: Path Arguments
ru: Аргументы Путей

source: File and directory paths are accepted. Patterns also work. Quotes are required when paths include spaces.
ru: Допускаются пути к файлам и директориям. Также допускаются паттерны. Если в пути есть пробелы, **необходимо** использовать кавычки.

source: You can use full paths: ::
ru: Вы можете использовать абсолютные пути: ::

source: Or relative paths: ::
ru: Или относительные пути: ::

source: You can specify a directory, only files with supported formats will be processed: ::
ru: Вы можете указать директорию, будут обработаны только файлы с поддерживаемыми форматами: ::

source: You can also use patterns. Each file matching the pattern will be passed as a separate argument: ::
ru: Вы также можете использовать паттерны. Каждый файл, соответствующий паттерну, будет передан в качестве отдельного аргумента: ::

source: You can combine multiple arguments, mixing files, directories, and patterns. However, use this with caution and ensure you understand the implications: ::
ru: Вы можете комбинировать несколько аргументов, смешивая файлы, директории и паттерны. Однако используйте эту функцию с осторожностью и убедитесь, что вы понимаете все последствия: ::

source: Output Directory
ru: Каталог Результатов

source: As mentioned earlier, you can convert entire directories at once.
ru: Как упоминалось ранее, вы можете конвертировать сразу целые каталоги.

source: By default, output files saved in same location.
ru: По умолчанию выходные файлы сохраняются в том же месте.

source: You can specify ``--output`` / ``-O`` parameter to change it. ::
ru: Вы можете указать параметр ``--output`` / ``-O``, чтобы изменить его. ::

source: Output Overwriting
ru: Перезапись Файлов

source: To prevent overwriting files, use ``--unique`` flag.
ru: Чтобы предотвратить перезапись файлов с одинаковым именем, используйте флаг ``--unique``.

source: Duplicates files will be renamed like ``model (2).obj``, ``model (3).obj`` and etc.
ru: Дубликаты файлов будут переименованы как ``model (2).obj``, ``model (3).obj`` и т.д.

source: Output Structure
ru: Структура Результатов

source: To preserve source directory structure, use ``--relative`` flag.
ru: Чтобы сохранить структуру исходного каталога, используйте флаг ``--relative``.

source: Relative path from path argument will be passed as relative path of base ``--output`` directory.
ru: Относительный путь из аргумента будет передан как относительный путь базового каталога ``--output``.

source: To use source root directory as starting point in output, use ``--parent`` flag.
ru: Чтобы использовать корневой каталог источника в качестве начальной точки в результате, используйте флаг ``--parent``.

source: Example source structure
ru: Пример исходной структуры

source: Default Structure
ru: По умолчанию

source: Output
ru: Результат

source: Relative Structure
ru: Относительная структура (``--relative``)

source: Parent Structure
ru: Родительская структура (``--parent``)
